Term4/matan/lectures/1.tex
% Created 2021-02-09 Tue 16:24
% Intended LaTeX compiler: pdflatex
\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}

 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\rank}{\text{rank}}
\newcommand{\const}{\text{const}}
\newcommand{\grad}{\text{grad}}

\theoremstyle{plain}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{exercise}{Упражнение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 1}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode )}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\renewcommand{\P}{\mathcal{P}}
\newcommand{\A}{\mathfrak{A}}
\newcommand{\B}{\mathfrak{B}}
\newcommand{\M}{\mathfrak{M}}

\section{Теория меры}
\label{sec:org7bdb928}
\begin{lemma}[о структуре компактного оператора]
\(V : \R^m \to \R^m\) --- невырожденный линейный оператор, т.е. \(\det V \neq 0\) \\
\uline{Тогда}:
\begin{itemize}
\item \(\exists\) ортонормированные базисы \(g_1, \dots, g_m;\ h_1, \dots, h_m\)
\item \(\exists S_1, \dots, S_m > 0\)
\end{itemize}
\[ \forall x \in \R^m\quad V(x) = \sum_{i = 1}^m S_i \langle x, g_i \rangle h_i$ \]
\color{gray} \(x = \sum \langle x, g_i \rangle g_i\) --- разложение по базису \color{black} \\
\textbf{При этом} \(\vert\det V\vert = S_1 S_2 \dots S_m\)
\label{org62b4da8}
\end{lemma}
\begin{proof}
\(W := V^*V\) \color{gray} * --- транспонирование в \(\R^m\) \color{black} \\
\color{gray} \(W\) --- самосопряженный оператор(матрица симметрична относительно диагонали) \color{black} \\
Собственные числа \(c_1, \dots, c_m\) --- вещественные \\
Собственные векторы \(g_1, \dots, g_m\) \\
Заметим что \(c_i\langle g_i, g_i \rangle = \langle Wg_i, g_i \rangle = \langle Vg_i, Vg_i \rangle > 0 \Rightarrow c_i > 0\) \\
\begin{itemize}
\item \(S_i := \sqrt{c_i}\) \\
\item \(h_i := \frac{1}{S_i} Vg_i\) \\
\end{itemize}
\[ \langle h_i, h_j \rangle = \frac{1}{S_iS_j}\langle Vg_i, Vg_j\rangle = \frac{1}{S_iS_j}\langle Wg_i, g_j\rangle = \frac{c_i}{S_iS_j}\langle g_i, g_j \rangle = \delta_i \]
\[ V(x) = V(\sum_{i=1}^n\langle x, g_i \rangle g_i) = \sum_{i = 1}^m \langle x, g_i \rangle V(g_i) = \sum s_i \langle x, g_i \rangle h_i \]
\[ (\det V)^2 = \det(V^*V) = \det W = c_1\dots c_m \addtag\label{diag_1} \]
\(\ref{diag_1}\) --- т.к. диагональная матрица
\label{org5b1f23a}
\end{proof}
\begin{theorem}[преобразование меры лебега при линейном отображении]
\-
\begin{itemize}
\item \(V: \R^m \to \R^m\) --- линейное отображение
\end{itemize}
\uline{Тогда}:
\begin{itemize}
\item \(\forall E \in \M^m\quad V(E) \in \M^m\)
\item \(\lambda(V(E)) = \vert \det V \vert \cdot \lambda E\)
\end{itemize}
\label{orgb08db77}
\end{theorem}
\begin{proof}
\- 
\begin{description}
\item[{(\(\det V = 0\))}] \(\text{Im}(V)\) --- подпространство в \(\R^m\) \(\Rightarrow\) мера \(=0\)
\item[{(\(\det V \neq 0\))}] \(\mu E := \lambda(V(E))\) --- мера \\
\(\mu\) --- инвариантна относительно сдвигов
\[ \mu(E + a) = \lambda(V(E + a)) = \lambda(V(E) + Va) = \lambda(V(E)) = \mu E \]
\(\Rightarrow\) \(\exists k: \mu = k\cdot \lambda\)(Лемма из предыдущего семестра) \\
\(Q\) --- единичный куб на векторах \(g_i\) и \(V(g_i) = S_ih_i\), \(V(Q) = \{\sum\alpha_iS_ih_i \vert \alpha_i \in [0,1]\}\) --- паралеллепипед со сторонами \(S_i, \dots, S_m\)
\end{description}
\label{org8d97f42}
\end{proof}
\section{Интеграл}
\label{sec:orgff7e778}
\subsection{Измеримые функции}
\label{sec:orgabae49a}
\begin{definition}
\-
\begin{enumerate}
\item \(E\) --- множество, \(E = \underset{\text{кон.}}{\bigsqcup}e_i\) --- \textbf{разбиение множества}
\item \(f: X \to \R\) --- \textbf{ступенчатая}, если \\
\(\exists\) разбиение \(X = \underset{\text{кон.}}{\bigsqcup}e_i:\ \forall i\ f\big\vert_{e_i} = \const = c_i\) \\
При этом такое разбиение --- \textbf{допустимое разбиение}
\end{enumerate}
\label{orgc2594d7}
\end{definition}
\begin{examp}
\-
\begin{enumerate}
\item Характеристическая функция множества \(E \subset \mathcal{X}_E(x) = \left[\begin{array}{ll} 1 & x \in E \\ 0 & x \in X \setminus E \end{array}\)
\item \(f = \subset{\text{кон.}}{\sum}c_i\mathcal{X}_{e_i}\), где \(\mathcal{X} = \bigsqcup e_i\)
\end{enumerate}
\label{org62262b2}
\end{examp}
\begin{remark}
\-
\begin{enumerate}
\item \(\forall f, g\) --- ступенчатые \\
\uline{Тогда} \(\exists\) разбиения, допутимые и для \(f\), и для \(g\) \\
\[ f = \sum_\text{кон.} c_i \mathcal{X}_{e_i}\quad h = \sum_\text{кон.} b_k \mathcal{X}_{A_k} \]
\[ f = \sum_{i, k} c_i \mathcal{X}_{e_i\cap A_k} \quad g = \sum b_k\cdot\mathcal{X}_{e_i \cap A_k} \]
\item \(f, g\) --- ступенчатые, \(\alpha \in \R\) \\
\uline{Тогда} \(f + g,\ \alpha f,\ fg,\ max(f, g),\ min(f, g),\ |f|\) --- ступенчатые
\end{enumerate}
\label{org1e1c836}
\end{remark}
\begin{definition}
\(f: E\subset X \to \overline{\R},\ a \in \R\) \\
\(E(f < a) = \{x\in E: f(x) < a\}\) --- \textbf{лебегово множество функции \(f\)} \\
\(E(f \le a),\ E(f > a), E(f \ge a)\) --- также лебеговы множества \\
Если \(f\) задана на \(X\): \(X(f < a),\ X(f \le a), \dots\) --- лебеговы множества
\label{org9e76c4d}
\end{definition}
\begin{remark}
\(E(f \ge a) = E(f < a)^C;\ E(f < a) = E(f \ge a)^C\) \\
\[ E(f \le a) = \bigcap_{b > a} E(f < b) = \bigcap_{n \in \N}E(f < a + \frac{1}{n})\]
\label{org932a5c8}
\end{remark}
\begin{definition}
\-
\begin{itemize}
\item \((X, \A, \mu)\) --- пространство с мерой
\item \(f: X \to \overline{\R}\)
\item \(E \in \A\)
\end{itemize}
\(f\) --- \textbf{измерима на множестве \(E\)}: \\
\(a \in \R\quad E(f < a)\) --- измеримо(т.е. \(\in \A\))
\label{orgea2f15d}
\end{definition}
\begin{symb}
\-
\begin{itemize}
\item \(f\) --- измеримо на \(X\) --- говорят просто "измеримо"
\item \(X = \R^m\), мера Лебега --- измеримо по Лебегу
\end{itemize}
\label{org9ff994c}
\end{symb}
\begin{remark}
Эквивалентны:
\begin{enumerate}
\item \(\forall a\quad E(f < a)\) --- измеримо
\item \(\forall a\quad E(f \le a)\) --- измеримо
\item \(\forall a\quad E(f > a)\) --- измеримо
\item \(\forall a\quad E(f \ge a)\) --- измеримо
\end{enumerate}
\label{org0d61473}
\end{remark}
\begin{examp}
\begin{enumerate}
\item \(E \subset X\), \(E\) --- измеримо, \(\mathcal{X}_E\) --- измеримо \\
\(E(\mathcal{X}_E < a) = \left[\begin{array}{ll} \emptyset & ,a < 0 \\ X \setminus E & ,0 <= a <= 1 \\ X & ,a > 1 \end{array}\)
\item \(f: \R^m \to \R\) --- непрерывна. Тогда \(f\) --- измеримо по Лебегу
\end{enumerate}
\label{orgdb2dd65}
\end{examp}
\begin{remark}
\emph{Свойства}:
\begin{enumerate}
\item \(f\) --- измерима на \(E\)
\begin{description}
\item[{\(\Rightarrow\)}] \(\forall a \in \R\) \(E(f = a)\) --- измеримо \\
\item[{\(\not \Leftarrow\)}] \(f: \R \to \R\quad f(x) = \mathcal{X} + \mathcal{X}_\text{неизм.}\)
\end{description}
\item \(f\) --- измерима \(\Rightarrow\) \(\forall \alpha \in R\quad \alpha f\) --- измерима
\item \(f\) --- измерима \(E_1, E_2, \dots \Rightarrow f\) --- измерима на \(E = \bigcup E_k\)
\item \(f\) --- измерима на \(E\); \(\underset{\text{изм.}}{E'} \subset E \Rightarrow f\) --- измерима на \(E'\) \\
\(E'(f < a) = E(f < a) \cap E'\)
\item \(f \neq 0\) --- измерима на \(E\) \(\Rightarrow\) \(\frac{1}{f}\) --- измерима на \(E\)
\item \(f \ge 0\), измерима на \(E\), \(\alpha \in \R\). \uline{Тогда} \(f^\alpha\) --- измерима на \(E\)
\end{enumerate}
\label{org0686530}
\end{remark}
\begin{theorem}
\(f_n\) --- измерима на \(X\). \\
\uline{Тогда}:
\begin{enumerate}
\item \[ \sup_{n \in \N} f_n;\quad \inf_{n \in \N} f_n \addtag\label{sup_inf_1} \]
\(\ref{sup_inf_1}\) --- измеримы
\item \(\overline{\lim} f_n;\quad\underline{\lim} f_n\) --- измеримы
\item Если \[ \forall x\ \exists \lim_{n \to +\infty}f_n(x) = h(x) \], то \(h(x)\) --- измеримо
\end{enumerate}
\label{org4a5f254}
\end{theorem}
\begin{proof}
\-
\begin{enumerate}
\item \(g = \sup f_n\quad X(g > a) = \bigcup X(f_n > a)\)
\item \[ (\overline{\lim} f_n)(x) = \inf\{s_n: s_n = \sup(f_n(x), f_{n + 1}(x), \dots)\} \]
\item очев.
\end{enumerate}
\label{orgf7ee1f8}
\end{proof}

\subsection{Меры Лебега-Стильеса}
\label{sec:org2798b92}
\begin{definition}
\(\R, \P^1, g:\R \to \R\) --- возрастает, непрерывна \\
\(\mu[a, b) := g(b) - g(a)\) --- \(\sigma\)-конечный объем \\
\[ g(a + 0) = \lim_{x \to a + 0}g(x), g(a - 0) = \lim_{x \to a - 0}g(x) \]
\[ \mu[a, b) := g(b-0) - g(a - 0) \]
--- тоже \(\sigma\)-конечная мера \\
Применим теорему о продолжении, получим меру \(\mu g\) на некой \(\sigma\)-алгебре --- \textbf{мера Лебега-Стилтьеса} 
\label{org92ef608}
\end{definition}
\begin{definition}
\(g(x) = \lceil x \rceil\) \\
Пусть \(\mu g\) определена на Борелевской \(\sigma\)-алгебре --- \textbf{мера Бореля-Стилтьеса}
\label{org1431505}
\end{definition}
\end{document}
